#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

module.KEYCLOAK_TEST.module.moh_applications.module.PLR_FLVR.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["USER-MANAGEMENT-SERVICE/view-client-plr_flvr"]: Refreshing state... [id=65c24b88-6fa7-4604-8b8e-74192a4dfc43/43fcffe7-7400-425f-8316-37411e19d241]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR_FLVR.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["USER-MANAGEMENT-SERVICE/view-client-plr_flvr"]: Refreshing state... [id=moh_applications/client/ab63ae34-0fda-4f1b-ac8f-1380bea87f44/scope-mappings/ab6e0d99-9205-4625-8ea4-88835ddd36ae/43fcffe7-7400-425f-8316-37411e19d241]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR_FLVR.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["USER-MANAGEMENT-SERVICE/view-clients"]: Refreshing state... [id=moh_applications/client/ab63ae34-0fda-4f1b-ac8f-1380bea87f44/scope-mappings/ab6e0d99-9205-4625-8ea4-88835ddd36ae/68933fe3-7eb8-44d8-b020-beeb54fade3d]
module.KEYCLOAK_TEST.module.moh_applications.module.PRIME-WEBAPP-ENROLLMENT-SERVICE.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["USER-MANAGEMENT-SERVICE/manage-user-details"]: Refreshing state... [id=moh_applications/client/c377e1c9-4dfb-4518-ab53-9b94c7765f54/scope-mappings/ab6e0d99-9205-4625-8ea4-88835ddd36ae/55179234-d6b5-4549-9e21-159bc9800425]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR_FLVR.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["USER-MANAGEMENT-SERVICE/view-clients"]: Refreshing state... [id=65c24b88-6fa7-4604-8b8e-74192a4dfc43/68933fe3-7eb8-44d8-b020-beeb54fade3d]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR_FLVR.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["USER-MANAGEMENT-SERVICE/view-users"]: Refreshing state... [id=65c24b88-6fa7-4604-8b8e-74192a4dfc43/8bea7469-b2b6-4799-b914-91ee2221a15a]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR_FLVR.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["realm-management/view-users"]: Refreshing state... [id=65c24b88-6fa7-4604-8b8e-74192a4dfc43/5a35e168-27ad-4fc4-a574-e81ada1cc9be]
module.KEYCLOAK_TEST.module.moh_applications.module.PRIME-WEBAPP-ENROLLMENT-SERVICE.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["USER-MANAGEMENT-SERVICE/manage-user-roles"]: Refreshing state... [id=moh_applications/client/c377e1c9-4dfb-4518-ab53-9b94c7765f54/scope-mappings/ab6e0d99-9205-4625-8ea4-88835ddd36ae/06799768-828d-4299-832b-0cc7a56684b0]
module.KEYCLOAK_TEST.module.moh_applications.module.PRIME-WEBAPP-ENROLLMENT-SERVICE.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["USER-MANAGEMENT-SERVICE/view-client-gis"]: Refreshing state... [id=moh_applications/client/c377e1c9-4dfb-4518-ab53-9b94c7765f54/scope-mappings/ab6e0d99-9205-4625-8ea4-88835ddd36ae/616c7534-19bb-4f56-b3ba-1eab1a47b7cb]
module.KEYCLOAK_TEST.module.moh_applications.module.PRIME-WEBAPP-ENROLLMENT-SERVICE.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["USER-MANAGEMENT-SERVICE/view-clients"]: Refreshing state... [id=moh_applications/client/c377e1c9-4dfb-4518-ab53-9b94c7765f54/scope-mappings/ab6e0d99-9205-4625-8ea4-88835ddd36ae/68933fe3-7eb8-44d8-b020-beeb54fade3d]
module.KEYCLOAK_TEST.module.moh_applications.module.PRIME-WEBAPP-ENROLLMENT-SERVICE.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["USER-MANAGEMENT-SERVICE/view-users"]: Refreshing state... [id=moh_applications/client/c377e1c9-4dfb-4518-ab53-9b94c7765f54/scope-mappings/ab6e0d99-9205-4625-8ea4-88835ddd36ae/8bea7469-b2b6-4799-b914-91ee2221a15a]
module.KEYCLOAK_TEST.module.moh_applications.module.PRIME-WEBAPP-ENROLLMENT-SERVICE.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["USER-MANAGEMENT-SERVICE/create-user"]: Refreshing state... [id=moh_applications/client/c377e1c9-4dfb-4518-ab53-9b94c7765f54/scope-mappings/ab6e0d99-9205-4625-8ea4-88835ddd36ae/cda7bc35-a61c-4822-b0cb-0c45ebe626cc]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR_SIT.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["USER-MANAGEMENT-SERVICE/view-users"]: Refreshing state... [id=3e03d396-6279-4d82-accf-d99cfe6d89df/8bea7469-b2b6-4799-b914-91ee2221a15a]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR_IAT.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["USER-MANAGEMENT-SERVICE/view-client-plr_iat"]: Refreshing state... [id=514bb64d-c836-46b8-adc5-a6fe857f644a/d5086c42-6157-4da9-89cd-54721ab9e97d]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR_IAT.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["USER-MANAGEMENT-SERVICE/view-clients"]: Refreshing state... [id=514bb64d-c836-46b8-adc5-a6fe857f644a/68933fe3-7eb8-44d8-b020-beeb54fade3d]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR_IAT.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["USER-MANAGEMENT-SERVICE/view-users"]: Refreshing state... [id=514bb64d-c836-46b8-adc5-a6fe857f644a/8bea7469-b2b6-4799-b914-91ee2221a15a]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR_IAT.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["realm-management/view-users"]: Refreshing state... [id=514bb64d-c836-46b8-adc5-a6fe857f644a/5a35e168-27ad-4fc4-a574-e81ada1cc9be]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR_SIT.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["realm-management/view-users"]: Refreshing state... [id=3e03d396-6279-4d82-accf-d99cfe6d89df/5a35e168-27ad-4fc4-a574-e81ada1cc9be]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR_SIT.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["USER-MANAGEMENT-SERVICE/view-client-plr_sit"]: Refreshing state... [id=3e03d396-6279-4d82-accf-d99cfe6d89df/77549ee3-e29e-41cc-b653-f5f0d5f417ed]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR_SIT.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["USER-MANAGEMENT-SERVICE/view-clients"]: Refreshing state... [id=3e03d396-6279-4d82-accf-d99cfe6d89df/68933fe3-7eb8-44d8-b020-beeb54fade3d]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR_STG.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["USER-MANAGEMENT-SERVICE/view-client-plr_stg"]: Refreshing state... [id=408a17fa-f51e-41b6-99c0-d837e8249f5d/91d9434c-b2cc-49a9-af56-4ac20d35477b]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR_STG.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["USER-MANAGEMENT-SERVICE/view-clients"]: Refreshing state... [id=408a17fa-f51e-41b6-99c0-d837e8249f5d/68933fe3-7eb8-44d8-b020-beeb54fade3d]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR_STG.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["USER-MANAGEMENT-SERVICE/view-users"]: Refreshing state... [id=408a17fa-f51e-41b6-99c0-d837e8249f5d/8bea7469-b2b6-4799-b914-91ee2221a15a]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR_STG.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["realm-management/view-users"]: Refreshing state... [id=408a17fa-f51e-41b6-99c0-d837e8249f5d/5a35e168-27ad-4fc4-a574-e81ada1cc9be]
module.KEYCLOAK_DEV.module.moh_applications.module.PIDP-WEBAPP.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PIDP-SERVICE/feature_pidp_demo"]: Refreshing state... [id=moh_applications/client/0a4aed42-f8c1-4004-8218-dc92b231dd70/scope-mappings/f2d7cc73-3c77-44e0-b6fb-cec2ea545629/a94bec86-0808-4f71-a947-b2049afc7d7e]
module.KEYCLOAK_DEV.module.moh_applications.module.PIDP-WEBAPP.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["account/view-profile"]: Refreshing state... [id=moh_applications/client/0a4aed42-f8c1-4004-8218-dc92b231dd70/scope-mappings/2e52bc4c-f321-4bff-98d8-8ce89cd3e2e7/22f2f067-d74a-4108-bf1a-eb6bffd71736]
module.KEYCLOAK_DEV.module.moh_applications.module.PIDP-WEBAPP.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PIDP-SERVICE/ADMIN"]: Refreshing state... [id=moh_applications/client/0a4aed42-f8c1-4004-8218-dc92b231dd70/scope-mappings/f2d7cc73-3c77-44e0-b6fb-cec2ea545629/9dbc8e8b-0e25-44cd-bd1b-34a1846ac269]
module.KEYCLOAK_DEV.module.moh_applications.module.PIDP-WEBAPP.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PIDP-SERVICE/USER"]: Refreshing state... [id=moh_applications/client/0a4aed42-f8c1-4004-8218-dc92b231dd70/scope-mappings/f2d7cc73-3c77-44e0-b6fb-cec2ea545629/7f31f194-bfcc-43fd-babe-bc9545292ede]
module.KEYCLOAK_DEV.module.moh_applications.module.PIDP-WEBAPP.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PIDP-SERVICE/feature_amh_demo"]: Refreshing state... [id=moh_applications/client/0a4aed42-f8c1-4004-8218-dc92b231dd70/scope-mappings/f2d7cc73-3c77-44e0-b6fb-cec2ea545629/f3d5d424-88cb-472f-a0b9-b99cc342f40f]
module.KEYCLOAK_TEST.module.moh_applications.module.PIDP-WEBAPP.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PIDP-SERVICE/ADMIN"]: Refreshing state... [id=moh_applications/client/1065e2c3-8280-4bce-a170-e7fe044b285e/scope-mappings/55c07ad0-ac04-4eed-b98a-85aa8551163f/c043fe54-6899-4e2e-94b6-a85c0051b7ab]
module.KEYCLOAK_TEST.module.moh_applications.module.PIDP-WEBAPP.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PIDP-SERVICE/USER"]: Refreshing state... [id=moh_applications/client/1065e2c3-8280-4bce-a170-e7fe044b285e/scope-mappings/55c07ad0-ac04-4eed-b98a-85aa8551163f/1814fe67-a84e-4ca7-9bcc-656b02c64c98]
module.KEYCLOAK_TEST.module.moh_applications.module.PIDP-WEBAPP.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PIDP-SERVICE/feature_amh_demo"]: Refreshing state... [id=moh_applications/client/1065e2c3-8280-4bce-a170-e7fe044b285e/scope-mappings/55c07ad0-ac04-4eed-b98a-85aa8551163f/3ab21315-dcb9-40fb-92e6-81b40759e8d6]
module.KEYCLOAK_TEST.module.moh_applications.module.PIDP-WEBAPP.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PIDP-SERVICE/feature_pidp_demo"]: Refreshing state... [id=moh_applications/client/1065e2c3-8280-4bce-a170-e7fe044b285e/scope-mappings/55c07ad0-ac04-4eed-b98a-85aa8551163f/458dd0fd-a742-4df1-b3ef-56ac85d7d8a9]
module.KEYCLOAK_TEST.module.moh_applications.module.PIDP-WEBAPP.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["account/view-profile"]: Refreshing state... [id=moh_applications/client/1065e2c3-8280-4bce-a170-e7fe044b285e/scope-mappings/f7e7a2f0-6e8c-4037-ae60-439017c25321/cada8e04-363d-4213-a77f-2991c3fa50a3]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.KEYCLOAK_DEV.module.moh_applications.module.LDAP-API.keycloak_openid_client.CLIENT will be created
  + resource "keycloak_openid_client" "CLIENT" {
      + access_type                               = "CONFIDENTIAL"
      + backchannel_logout_session_required       = true
      + client_authenticator_type                 = "client-secret"
      + client_id                                 = "LDAP-API"
      + client_secret                             = (sensitive value)
      + consent_required                          = false
      + description                               = "Client created to send requests to Organizations API"
      + direct_access_grants_enabled              = false
      + display_on_consent_screen                 = false
      + enabled                                   = true
      + exclude_session_state_from_auth_response  = false
      + frontchannel_logout_enabled               = false
      + full_scope_allowed                        = false
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = "moh_applications"
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = true
      + standard_flow_enabled                     = false
      + use_refresh_tokens                        = true
      + use_refresh_tokens_client_credentials     = false
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.LDAP-API.module.service-account-roles.keycloak_openid_client_service_account_realm_role.ROLE["offline_access"] will be created
  + resource "keycloak_openid_client_service_account_realm_role" "ROLE" {
      + id                      = (known after apply)
      + realm_id                = "moh_applications"
      + role                    = "offline_access"
      + service_account_user_id = (known after apply)
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.LDAP-API.module.service-account-roles.keycloak_openid_client_service_account_realm_role.ROLE["uma_authorization"] will be created
  + resource "keycloak_openid_client_service_account_realm_role" "ROLE" {
      + id                      = (known after apply)
      + realm_id                = "moh_applications"
      + role                    = "uma_authorization"
      + service_account_user_id = (known after apply)
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.LDAP-API.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["ORGANIZATIONS-API/get-org"] will be created
  + resource "keycloak_openid_client_service_account_role" "ROLE" {
      + client_id               = "e80136f5-76d2-4286-bde2-ea835b0e2b64"
      + id                      = (known after apply)
      + realm_id                = "moh_applications"
      + role                    = "get-org"
      + service_account_user_id = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @filipflorek, Action: `pull_request`*